export const idiomDicitionary = [
  {
    id: 1,
    words: '以邻为壑',
    notes: '壑，深沟。把邻国当作排泄本国洪水的大水坑。比喻把自己的困难或祸害 转嫁给别人。',
  },
  {
    id: 2,
    words: '亦步亦趋',
    notes: '别人慢走，跟着慢走；别人快走，跟着快走，比喻没有主张，事事都模仿 或追随别人。也可以在模仿抄袭中使用。',
  },
  {
    id: 3,
    words: '背道而驰',
    notes: '朝着相反的方向奔跑。比喻行动跟既定方向完全相反。',
  },
  {
    id: 4,
    words: '唇齿相依',
    notes: '比喻互相依存，关系密切。',
  },
  {
    id: 5,
    words: '独善其身',
    notes: '原意是做不上官就修养好自身，现指只顾自己，不管别人。 ',
  },
  {
    id: 6,
    words: '明哲保身',
    notes: '明智的人善于保全自己，现指因怕连累自己而回避原则斗争的处世态度（偏 贬义）。',
  },
  {
    id: 7,
    words: '投鼠忌器',
    notes: '想用东西打老鼠，又怕打坏了近旁的器物，比喻做事情有顾忌，不敢放手去干。',
  },
  {
    id: 8,
    words: '南辕北辙',
    notes: '本想往南走，却驾着车往北走，比喻行动和目的相反。（一个主体）',
  },
  {
    id: 9,
    words: '分道扬镳',
    notes: '比喻因志向或者目标不同而各奔前程。（两个主体，例：科学与哲学分道扬镳。）',
  },
  {
    id: 10,
    words: '隔岸观火',
    notes: '火代指危难。站在对岸观看着火，比喻对别人的危难漠不关心。',
  },
  {
    id: 11,
    words: '袖手旁观',
    notes: '把手笼在袖子里，在一旁观看。比喻置身事外，即不过问，也不协作别人。（本身没你什么事，相对口语化。）',
  },
  {
    id: 12,
    words: '置身事外',
    notes: '把自己放在事情之外，毫不关心。（自己就是其中的一员，本身有你事。）',
  },
  {
    id: 13,
    words: '作壁上观',
    notes: '原指双方交战，自己站在壁垒上旁观。后多比喻站在一旁看着，不动手帮助。',
  },
  {
    id: 14,
    words: '泥沙俱下',
    notes: '比喻好的和坏的混在一起。（可以指人可以指物）',
  },
  {
    id: 15,
    words: '良莠不齐',
    notes: '指好人坏人都有，混在一起。现在也可以用于产品、市场等好坏事物混杂一起。（可以指人可以指物）',
  },
  {
    id: 16,
    words: '鱼龙混杂',
    notes: '比喻成员复杂，好人坏人混在一起。',
  },
  {
    id: 17,
    words: '鱼目混珠',
    notes: '比喻以假乱真，以次充好。强调冒充。',
  },
  {
    id: 18,
    words: '拔苗助长',
    notes: '比喻违反事物发展的客观规律，急于求成，反而坏事。（多形容孩子\\产业）',
  },
  {
    id: 19,
    words: '越俎代庖',
    notes: '比喻超出自己的职责范围，去替别人处理事情。（多形容教育\\政府与市场的关系）',
  },
  {
    id: 20,
    words: '刻舟求剑',
    notes: '办事刻板拘泥，不根据实际情况处理问题。（不以发展的眼光看问题）',
  },
  {
    id: 21,
    words: '守株待兔',
    notes: '原比喻希图不经过努力而得到成功的侥幸心理，现也比喻死守狭隘经验，不知变通。（不主动出击或不劳而获，依靠运气、侥幸）',
  },
  {
    id: 22,
    words: '休戚与共',
    notes: '休：欢乐，喜悦。戚：忧愁，祸患。彼此之间忧喜祸福都共同承受。形容同甘共苦。',
  },
  {
    id: 23,
    words: '息息相关',
    notes: '息：呼吸时进出的气。呼吸也相互关联。形容彼此的关系非常密切。',
  },
  {
    id: 24,
    words: '互通有无',
    notes: '拿出自己多余的东西给对方，与之进行交换，以得到自己所缺少的东西。',
  },
  {
    id: 25,
    words: '水乳交融',
    notes: '交融：融合在一起。水和乳汁融合在一起。比喻关系非常融洽或结合得十分紧密。',
  },
  {
    id: 26,
    words: '一蹴而就',
    notes: '踏一步就成功。形容事情轻而易举，一下子就能完成。',
  },
  {
    id: 27,
    words: '一劳永逸',
    notes: '辛苦一次，把事情办好，以后就不再费事了。',
  },
  {
    id: 28,
    words: '立竿见影',
    notes: '把竹竿竖在太阳光下，立刻就能看到影子。比喻收效非常迅速。',
  },
  {
    id: 29,
    words: '一挥而就',
    notes: '挥：挥笔；就：成功。一动笔就写成了。形容写字、写文章、画画快。',
  },
  {
    id: 30,
    words: '一步登天',
    notes: '比喻一下子达到最高的境界或程度。也比喻地位一下子升得很高。',
  },
  {
    id: 31,
    words: '饮鸩止渴',
    notes: '用毒酒解渴。比喻只求解决目前困难而不计后果。',
  },
  {
    id: 32,
    words: '寅吃卯粮',
    notes: '寅年吃了卯年的口粮，比喻入不敷出，提前支用了以后的收入。',
  },
  {
    id: 33,
    words: '竭泽而渔',
    notes: '排尽湖水或池水捉鱼。比喻只图眼前利益，不作长远打算：应该考虑长远，不能～。',
  },
  {
    id: 34,
    words: '杀鸡取卵',
    notes: '比喻贪图眼前利益而不顾长远利益。',
  },
  {
    id: 35,
    words: '并行不悖',
    notes: '悖：违背，冲突。同时进行，不相冲突。',
  },
  {
    id: 36,
    words: '并驾齐驱',
    notes: '并排套着的几匹马一齐快跑。比喻彼此的力量或才能不分高下。',
  },
  {
    id: 37,
    words: '齐头并进',
    notes: '多方面同时前进。多形容几件事情或几项工作同时进行。',
  },
  {
    id: 38,
    words: '相辅相成',
    notes: '辅：辅助。指两件事物互相配合，互相辅助，缺一不可。',
  },
  {
    id: 39,
    words: '相得益彰',
    notes: '相得：互相配合、映衬；益：更加；彰：显著。指两个人或两件事物互相配合，双方的能力和作用更能显示出来。',
  },
  {
    id: 40,
    words: '锦上添花',
    notes: '比喻美上加美，好上加好。',
  },
  {
    id: 41,
    words: '珠联璧合',
    notes: '珍珠联成串，美玉放在一起。比喻杰出的人才或美好的事物聚集在一起。',
  },
  {
    id: 42,
    words: '春风化雨',
    notes: '化：化生和养育。指适宜于草木生长的风雨。比喻良好的薰陶和教育。',
  },
  {
    id: 43,
    words: '和风细雨',
    notes: '和风：春天的风。细雨：小雨。微风习习，细雨濛濛。比喻做事温和、细致，不粗暴或方式和缓。',
  },
  {
    id: 44,
    words: '潜移默化',
    notes: '指人的思想、性格和习惯等在不知不觉中受到外界影响而逐渐发生变化。',
  },
  {
    id: 45,
    words: '耳濡目染',
    notes: '耳朵经常听到，眼睛经常看到，不知不觉地受到影响。',
  },
  {
    id: 46,
    words: '因循守旧',
    notes: '因循：沿袭；守旧：死守老的一套。死守老一套，缺乏创新的精神。',
  },
  {
    id: 47,
    words: '墨守成规',
    notes: '形容思想保守，按老规矩办事，不求改进。',
  },
  {
    id: 48,
    words: '抱残守缺',
    notes: '抱着残缺陈旧的东西不放。形容思想保守，不求改进。',
  },
  {
    id: 49,
    words: '故步自封',
    notes: '自己停留在原地。比喻保守，安于现状，不求进步。也作固步自封。',
  },
  {
    id: 50,
    words: '源远流长',
    notes: '水源很远，水流很长。比喻历史悠久。',
  },
  {
    id: 51,
    words: '连绵不绝',
    notes: '连续而不中断。',
  },
  {
    id: 52,
    words: '历久弥新',
    notes: '指一样东西不因时间而变旧，反而更加有活力，更显价值，比新的还要好。',
  },
  {
    id: 53,
    words: '推陈出新',
    notes: '去掉旧事物的糟粕，吸取其精华，使它以新的面目出现。',
  },
  {
    id: 54,
    words: '革故鼎新',
    notes: '旧指朝政变革或改朝换代。现泛指除去旧的，建立新的。',
  },
  {
    id: 55,
    words: '触类旁通',
    notes: '触类：接触某一方面的事物。旁通：互相贯通。指掌握或懂得了某一事物的知识或规律后，就可以推知同类的其他事物。',
  },
  {
    id: 56,
    words: '融会贯通',
    notes: '融会：融合，领会。贯通：贯穿前后、全面透彻地理解。指融合贯穿各方面的知识，得到全面、系统、透彻的理解。',
  },
  {
    id: 57,
    words: '举一反三',
    notes: '反：类推。比喻从一件事情类推而知道其他许多事情。',
  },
  {
    id: 58,
    words: '浮光掠影',
    notes: '强调结果、印象不深刻。',
  },
  {
    id: 59,
    words: '走马观花',
    notes: '强调过程（旅游）。',
  },
  {
    id: 60,
    words: '蜻蜓点水',
    notes: '做事肤浅不深入（调查、执法）。',
  },
  {
    id: 61,
    words: '浅尝辄止',
    notes: '用在读书做学问的语境，比喻做事不肯下功夫钻研。',
  },
  {
    id: 62,
    words: '根深蒂固',
    notes: '多指观念，基础深厚，不容易动摇。中性词。',
  },
  {
    id: 63,
    words: '积习难改',
    notes: '多年养成的习惯，不容易改变。偏中性。',
  },
  {
    id: 64,
    words: '积重难返',
    notes: '强调问题，偏贬义、消极。',
  },
  {
    id: 65,
    words: '深入人心',
    notes: '多指理念。',
  },
  {
    id: 66,
    words: '经久不衰',
    notes: '经历很久而不衰败。',
  },
  {
    id: 67,
    words: '长盛不衰',
    notes: '长久兴盛而不衰败，多形容文化传统、国家、民族、政党。',
  },
  {
    id: 68,
    words: '靡然成风',
    notes: '贬义词，形成一种不好的风气。',
  },
  {
    id: 69,
    words: '蔚然成风',
    notes: '褒义词，形成一种良好的风气。',
  },
  {
    id: 70,
    words: '大行其道',
    notes: '强调某种新事物正盛行，中性偏贬义。',
  },
  {
    id: 71,
    words: '纤毫毕现',
    notes: '形容完全显现出来，或暴露无遗。',
  },
  {
    id: 72,
    words: '方兴未艾',
    notes: '形容某新事物正兴起，一般做谓语，新产业、事业、经济~；~的……。',
  },
  {
    id: 73,
    words: '层出不穷',
    notes: '新技术、新应用接连不断地出现。',
  },
  {
    id: 74,
    words: '风起云涌',
    notes: '许多事物相继兴起，声势浩大，多形容革命、改革、运动。',
  },
  {
    id: 75,
    words: '高歌猛进',
    notes: '强调发展的势头非常好。',
  },
  {
    id: 76,
    words: '如火如荼',
    notes: '强调现状热烈、激烈。',
  },
  {
    id: 77,
    words: '应运而生',
    notes: '在恰当的时机、……背景下出现。',
  },
  {
    id: 78,
    words: '水涨船高',
    notes: '随着……的基础而……。',
  },
  {
    id: 79,
    words: '随波逐流',
    notes: '随大流。',
  },
  {
    id: 80,
    words: '人云亦云',
    notes: '没有主见，随声附和（拾人牙慧：学别人说过的话，抄袭）。',
  },
  {
    id: 81,
    words: '因势利导',
    notes: '顺着形式加以引导（主语通常为政府）。',
  },
  {
    id: 82,
    words: '顺势而为',
    notes: '顺应形势，不要逆势而行。',
  },
  {
    id: 83,
    words: '不谋而合',
    notes: '事前没商量意见，行动却一致。',
  },
  {
    id: 84,
    words: '交相辉映',
    notes: '互相映照，形容美好的景象。',
  },
  {
    id: 85,
    words: '纲举目张',
    notes: '1、抓住主要环节，可以带动其他环节。2、抓住要领，条理清晰。',
  },
  {
    id: 86,
    words: '佶屈聱牙',
    notes: '文章艰涩，读起来不顺口。',
  },
  {
    id: 87,
    words: '鞭长莫及',
    notes: '相隔太远，力量达不到。',
  },
  {
    id: 88,
    words: '望洋兴叹',
    notes: '力量不够或条件缺乏而感到无可奈何。',
  },
  {
    id: 89,
    words: '不容置喙',
    notes: '不允许插嘴。',
  },
  {
    id: 90,
    words: '囫囵吞枣',
    notes: '学习不加分析，不求充分理解。',
  },
  {
    id: 91,
    words: '鬼斧神工',
    notes: '指大自然。',
  },
  {
    id: 92,
    words: '咬文嚼字',
    notes: '（1）字斟句酌、反复推敲、十分讲究。（积极）（2）形容过分地斟酌字句。指只注意文字的表述、死扣字眼，而不注意精神实质。也形容故意卖弄学识。（消极）',
  },
  {
    id: 93,
    words: '鳞次栉比',
    notes: '形容房屋或船只等排列得很密很整齐。',
  },
  {
    id: 94,
    words: '不可捉摸',
    notes: '指对人或事物无法猜测和估量。',
  },
  {
    id: 95,
    words: '星罗棋布',
    notes: '形容数量很多，分布很广。',
  },
  {
    id: 96,
    words: '波诡云谲',
    notes: '形容事态变幻莫测，一般搭配宫廷秘事。',
  },
  {
    id: 97,
    words: '浩如烟海',
    notes: '形容文献、资料等极为丰富。',
  },
  {
    id: 98,
    words: '变化莫测',
    notes: '变化很多，不能预料。',
  },
  {
    id: 99,
    words: '不计其数',
    notes: '没法计算数目，形容很多。',
  },
  {
    id: 100,
    words: '变幻无常',
    notes: '事物经常变化，没有规律性。',
  },
  {
    id: 101,
    words: '雅俗共享',
    notes: '既优美，又通俗，各种文化程度的人都能够欣赏。',
  },
  {
    id: 102,
    words: '熠熠生辉',
    notes: '形容光彩闪耀的样子。',
  },
  {
    id: 103,
    words: '风靡一时',
    notes: '形容事物在一个时期里极其盛行。',
  },
  {
    id: 104,
    words: '赏心悦目',
    notes: '指看到美好的景色而心情愉快。',
  },
  {
    id: 105,
    words: '曲高和寡',
    notes: '不通俗。',
  },
  {
    id: 106,
    words: '美不胜收',
    notes: '美好的东西很多，一时看不过来。',
  },
  {
    id: 107,
    words: '喜闻乐见',
    notes: '喜欢听，乐意看，指很受欢迎。',
  },
  {
    id: 108,
    words: '大放异彩',
    notes: '比喻有着优异的表现或是突出的成就。',
  },
  {
    id: 109,
    words: '反客为主',
    notes: '比喻变被动为主动。',
  },
  {
    id: 110,
    words: '以一持万',
    notes: '形容抓住关键，可以控制全局。',
  },
  {
    id: 111,
    words: '主客颠倒',
    notes: '比喻事物轻重大小颠倒了位置。',
  },
  {
    id: 112,
    words: '舍本逐末',
    notes: '不抓根本环节，而只在枝节问题上下功夫。',
  },
  {
    id: 113,
    words: '喧宾夺主',
    notes: '来的、次要的事物侵占了原有的、主要的事物的地位。',
  },
  {
    id: 114,
    words: '本末倒置',
    notes: '比喻把主次、轻重的位置弄颠倒了。',
  },
  {
    id: 115,
    words: '太阿倒持',
    notes: '比喻以把柄授与人，自身反面临危险或灾害。',
  },
  {
    id: 116,
    words: '轻重倒置',
    notes: '把重要的和不重要的两者的地位摆颠倒了。',
  },
  {
    id: 117,
    words: '千金难求',
    notes: '比喻有钱但是买不到。',
  },
  {
    id: 118,
    words: '不可多得',
    notes: '形容非常稀少，很难得到。',
  },
  {
    id: 119,
    words: '难能可贵',
    notes: '不容易做到的事居然能做到，非常可贵。',
  },
  {
    id: 120,
    words: '绝无仅有',
    notes: '只有一个，再没有别的，形容非常少有。',
  },
  {
    id: 121,
    words: '委曲求全',
    notes: '勉强迁就，以求保全。',
  },
  {
    id: 122,
    words: '口若悬河',
    notes: '讲起话来滔不绝。',
  },
  {
    id: 123,
    words: '心如止水',
    notes: '形容心境平静，毫无杂念。',
  },
  {
    id: 124,
    words: '指桑骂槐',
    notes: '比喻表面上骂这个人，实际上骂那个人。',
  },
  {
    id: 125,
    words: '波澜不惊',
    notes: '比喻局势平稳，心态镇定。',
  },
  {
    id: 126,
    words: '口诛笔伐',
    notes: '从口头和书面上对坏人坏事进行揭露和声讨。',
  },
  {
    id: 127,
    words: '事与愿违',
    notes: '事情没能按照预想的方向发展。',
  },
  {
    id: 128,
    words: '津津乐道',
    notes: '很有兴趣地说个不停。',
  },
  {
    id: 129,
    words: '各有怀抱',
    notes: '各有各的胸怀、心意。',
  },
  {
    id: 130,
    words: '各自为政',
    notes: '不考虑全局，各搞一套。',
  },
  {
    id: 131,
    words: '草蛇灰线',
    notes: '比喻事物留下隐约可寻的线索和迹象。',
  },
  {
    id: 132,
    words: '分庭抗礼',
    notes: '比喻平起平坐、地位相等或互相对立。',
  },
  {
    id: 133,
    words: '泛滥成灾',
    notes: '比喻一件事物，多到了影响正常生活的情况。',
  },
  {
    id: 134,
    words: '甚器尘上',
    notes: '多指某种言论十分器张。',
  },
  {
    id: 135,
    words: '沸反盈天',
    notes: '形容人声喧闹，乱成一片。',
  },
  {
    id: 136,
    words: '无孔不入',
    notes: '比喻消极的东西易于渗入，有空子就钻。',
  },
  {
    id: 137,
    words: '一马当先',
    notes: '形容领先或带头。',
  },
  {
    id: 138,
    words: '突飞猛进',
    notes: '形容进步和发展特别迅速。',
  },
  {
    id: 139,
    words: '快马加鞭',
    notes: '比喻快上加快。',
  },
  {
    id: 140,
    words: '一日千里',
    notes: '进步或发展极快。',
  },
  {
    id: 141,
    words: '寥寥无几',
    notes: '非常稀少，没有几个。',
  },
  {
    id: 142,
    words: '所剩无几',
    notes: '剩下的没有多少了。',
  },
  {
    id: 143,
    words: '凤毛麟角',
    notes: '比喻珍贵而稀少的人或物。',
  },
  {
    id: 144,
    words: '比拼',
    notes: '拼力比试。',
  },
  {
    id: 145,
    words: '比肩',
    notes: '相当，比喻地位相等。',
  },
  {
    id: 146,
    words: '抗衡',
    notes: '对抗、不相上下。',
  },
  {
    id: 147,
    words: '屈指可数',
    notes: '数目少，形容突出的人或事。',
  },
  {
    id: 148,
    words: '媲美',
    notes: '美/好的程度差不多。',
  },
  {
    id: 149,
    words: '道听途说',
    notes: '泛指没有根据的传闻。',
  },
  {
    id: 150,
    words: '逸闻琐事',
    notes: '指世人不大知道而感兴趣的传闻和故事。',
  },
  {
    id: 151,
    words: '稗官野史',
    notes: '指旧时的小说和私人编撰的史书。',
  },
  {
    id: 152,
    words: '街谈巷议',
    notes: '大街小巷里人们的议论。',
  },
  {
    id: 153,
    words: '手足无措',
    notes: '形容举动慌张，或无法应付。',
  },
  {
    id: 154,
    words: '全神贯注',
    notes: '注意力高度集中。',
  },
  {
    id: 155,
    words: '无忧无虑',
    notes: '没有一点忧愁。',
  },
  {
    id: 156,
    words: '独木难支',
    notes: '比喻一个人的力量难以支撑全局。',
  },
  {
    id: 157,
    words: '念兹在兹',
    notes: '念：思念。兹：此，这个。泛指念念不忘某一件事情。',
  },
  {
    id: 158,
    words: '心无旁骛',
    notes: '心思集中，专心致志。',
  },
  {
    id: 159,
    words: '漏洞百出',
    notes: '形容文章、说话或办事，破绽很多。',
  },
  {
    id: 160,
    words: '四平八稳',
    notes: '形容说话做事稳当;只求不出差错，缺乏积极创新精神。',
  },
  {
    id: 161,
    words: '栉风沐雨',
    notes: '形容人经常在外面不顾风雨地辛苦奔波。',
  },
  {
    id: 162,
    words: '交口赞誉',
    notes: '异口同声地称赞。',
  },
  {
    id: 163,
    words: '呕心沥血',
    notes: '比喻费尽心血-工作、事业、创作。',
  },
  {
    id: 164,
    words: '心驰神往',
    notes: '形容一心向往。',
  },
  {
    id: 165,
    words: '鞠躬尽瘁',
    notes: '恭敬谨慎，尽心竭力，奉献一切。',
  },
  {
    id: 166,
    words: '如数家珍',
    notes: '比喻对所讲的事情十分熟悉。',
  },
  {
    id: 167,
    words: '筚路蓝缕',
    notes: '形容创业的艰苦。',
  },
  {
    id: 168,
    words: '慎终追远',
    notes: '旧指慎重地办理父母丧事，虔诚地祭祀远代祖先。后也指谨慎从事，追念前贤。',
  },
  {
    id: 169,
    words: '巨细无遗',
    notes: '大小都没有遗漏。',
  },
  {
    id: 170,
    words: '倍感沮丧',
    notes: '感到灰心失望。',
  },
  {
    id: 171,
    words: '不着边际',
    notes: '言论空泛，不切实际。',
  },
  {
    id: 172,
    words: '广袤无边',
    notes: '比喻非常广阔。',
  },
  {
    id: 173,
    words: '不知所措',
    notes: '不知道怎么办才好。',
  },
  {
    id: 174,
    words: '抽丝剥茧',
    notes: '丝得一根一根地抽，茧得一层一层地剥。形容分析事物极为细致，而且一步一步很有层次。',
  },
  {
    id: 175,
    words: '颠三倒四',
    notes: '说话办事没有次序，没有条理。',
  },
  {
    id: 176,
    words: '鸣金收兵',
    notes: '比喻战斗暂时结束。',
  },
  {
    id: 177,
    words: '风和日丽',
    notes: '形容晴朗暖和的天气。',
  },
  {
    id: 178,
    words: '空手而归',
    notes: '指带着失败而回。',
  },
  {
    id: 179,
    words: '月朗星稀',
    notes: '皓月当空，星星稀少。',
  },
  {
    id: 180,
    words: '打道回府',
    notes: '取道回家或原路返回。',
  },
  {
    id: 181,
    words: '天公作美',
    notes: '老天爷成全好事。',
  },
  {
    id: 182,
    words: '无功而返',
    notes: '指没有任何成效而回来。',
  },
  {
    id: 183,
    words: '万里无云',
    notes: '形容天气晴朗。',
  },
  {
    id: 184,
    words: '外强中干',
    notes: '外表强壮，内里空虚。',
  },
  {
    id: 185,
    words: '乍暖还寒',
    notes: '形容冬末春初气侯忽冷忽热，冷热不定。',
  },
  {
    id: 186,
    words: '入不敷出',
    notes: '收入不够支出。',
  },
  {
    id: 187,
    words: '犹抱琵琶',
    notes: '娇羞;不表态;不露面。',
  },
  {
    id: 188,
    words: '踟蹰不前',
    notes: '迟疑不决，不敢前进。',
  },
  {
    id: 189,
    words: '若隐若现',
    notes: '隐隐约约。',
  },
  {
    id: 190,
    words: '优柔寡断',
    notes: '指做事犹豫，缺乏决断。',
  },
  {
    id: 191,
    words: '东躲西藏',
    notes: '形容为了逃避灾祸而到处躲藏。',
  },
  {
    id: 192,
    words: '沧海桑田',
    notes: '比喻世事变化很大。',
  },
  {
    id: 193,
    words: '金瓯无缺',
    notes: '比喻国土完整。',
  },
  {
    id: 194,
    words: '熙熙攘攘',
    notes: '形容人来人往，非常热闹。',
  },
  {
    id: 195,
    words: '完璧归赵',
    notes: '原物完整无损地归还本人。',
  },
  {
    id: 196,
    words: '白云苍狗',
    notes: '比喻事物变化不定。',
  },
  {
    id: 197,
    words: '精挑细选',
    notes: '非常仔细的挑选的意思。',
  },
  {
    id: 198,
    words: '舍我其谁',
    notes: '形容人敢于担当，遇有该做的事，决不退让。',
  },
  {
    id: 199,
    words: '严丝合缝',
    notes: '缝隙密合;也可比喻言行周密，没有一点漏洞。',
  },
  {
    id: 200,
    words: '炉火纯青',
    notes: '比喻功夫达到了纯熟完美的境界。',
  },
  {
    id: 201,
    words: '不分轩轾',
    notes: '分不出高下;比喻对待二者的态度或看法差不多。',
  },
  {
    id: 202,
    words: '目无全牛',
    notes: '比喻技术熟练到了得心应手的境界。',
  },
  {
    id: 203,
    words: '不分畛域',
    notes: '不分界限、范围;也比喻不分彼此。',
  },
  {
    id: 204,
    words: '言不及义',
    notes: '及：涉及。义：正经的道理。净说些无聊的话，说不到问题的关键所在，没有一句说到正经的道理。',
  },
  {
    id: 205,
    words: '不谋而同',
    notes: '事先没有商量过，意见或行动却完全一致。',
  },
  {
    id: 206,
    words: '登峰造极',
    notes: '比喻学问、技能等达到最高的境界或成就。',
  },
  {
    id: 207,
    words: '不爽毫厘',
    notes: '形容一点不差。',
  },
  {
    id: 208,
    words: '肝肠寸断',
    notes: '比喻伤心到极点。',
  },
  {
    id: 209,
    words: '灰心丧气',
    notes: '形容因失败或不顺利而失去信心，意志消沉。',
  },
  {
    id: 210,
    words: '伤心欲绝',
    notes: '指极度悲哀，万分伤心得样子。',
  },
  {
    id: 211,
    words: '痛不欲生',
    notes: '悲痛得不想活下去，形容悲伤到极点。',
  },
  {
    id: 212,
    words: '莫此为甚',
    notes: '没有什么能超过这个的了。',
  },
  {
    id: 213,
    words: '大展拳脚',
    notes: '放开手脚大干一场。',
  },
  {
    id: 214,
    words: '毋庸置疑',
    notes: '事实明显或理由充分，不必怀疑。',
  },
  {
    id: 215,
    words: '大马金刀',
    notes: '豪爽，气派大;说话直率锋利。',
  },
  {
    id: 216,
    words: '未定之天',
    notes: '比喻事情还没有决定。',
  },
  {
    id: 217,
    words: '大有可观',
    notes: '很值得看，很值得重视。',
  },
  {
    id: 218,
    words: '不言而喻',
    notes: '形容道理很明显。',
  },
  {
    id: 219,
    words: '大有作为',
    notes: '能够极大地发挥作用。',
  },
  {
    id: 220,
    words: '冰山一角',
    notes: '所暴露出来的只是事物的一小部分。',
  },
  {
    id: 221,
    words: '只言片语',
    notes: '个别词句或片断的话。',
  },
  {
    id: 222,
    words: '九牛一毛',
    notes: '比喻极大数量中极微小的数量，微不足道。',
  },
  {
    id: 223,
    words: '细枝末节',
    notes: '比喻事情或问题的细小而无关紧要的部分。',
  },
  {
    id: 224,
    words: '遮风挡雨',
    notes: '比喻起保护作用。',
  },
  {
    id: 225,
    words: '保驾护航',
    notes: '保护某事物能让其能正常发展。',
  },
  {
    id: 226,
    words: '披荆斩棘',
    notes: '比喻在前进道路上清除障碍，克服重重困难。',
  },
  {
    id: 227,
    words: '添砖加瓦',
    notes: '比喻做一些工作，尽一点力量。',
  },
  {
    id: 228,
    words: '此消彼长',
    notes: '这个下降，那个上升。',
  },
  {
    id: 229,
    words: '弱肉强食',
    notes: '动物中弱者被强者吞食，比喻弱的被强的吞并。',
  },
  {
    id: 230,
    words: '优胜劣汰',
    notes: '优的得以胜出，劣的将被淘汰。',
  },
  {
    id: 231,
    words: '物竞天择',
    notes: '原指生物进化的一般规律，后用于人类社会的发展。',
  },
  {
    id: 232,
    words: '比比皆是',
    notes: '到处都是，形容极其常见。',
  },
  {
    id: 233,
    words: '恒河沙数',
    notes: '形容数量多到无法计算。',
  },
  {
    id: 234,
    words: '汗牛充栋',
    notes: '形容藏书非常多。',
  },
  {
    id: 235,
    words: '适得其反',
    notes: '恰恰得到与预期相反的结果。',
  },
  {
    id: 236,
    words: '难以为继',
    notes: '难于继续下去。',
  },
  {
    id: 237,
    words: '运筹帷幄',
    notes: '指拟定作战策略，引申为筹划、指挥。',
  },
  {
    id: 238,
    words: '吉光片羽',
    notes: '吉光：古代神话中的神兽名。片羽：一片毛。古代汉族传说中，吉光是神兽，毛皮为裘，入水数日不沉，入火不焦。比喻残存的珍贵文物。',
  },
  {
    id: 239,
    words: '指点迷津',
    notes: '针对事物的困难处，提供解决的方向、办法或途径。',
  },
  {
    id: 240,
    words: '以微知著',
    notes: '从事物露出的苗头，可以推知它的发展趋向或他的实质。',
  },
  {
    id: 241,
    words: '建言献策',
    notes: '陈述主张或意见。',
  },
  {
    id: 242,
    words: '急功近利',
    notes: '功：成功。近：眼前的。急于求成，贪图眼前的成效和利益。',
  },
  {
    id: 243,
    words: '出谋划策',
    notes: '制定计谋策略，指为人出主意。',
  },
  {
    id: 244,
    words: '老生常谈',
    notes: '比喻人们听惯了的没有新鲜意思的话。',
  },
  {
    id: 245,
    words: '耳熟能详',
    notes: '指听得多了，能够说得很清楚、很详细。',
  },
  {
    id: 246,
    words: '冠冕堂皇',
    notes: '形容故意显得外表庄严体面或正大的样子，实际上并非如此。',
  },
  {
    id: 247,
    words: '烂熟于心',
    notes: '形容对某件事情或者事物的发展情况在心里记得很清楚。',
  },
  {
    id: 248,
    words: '陈词滥调',
    notes: '指陈腐、空泛的论调。',
  },
  {
    id: 249,
    words: '轻车熟路',
    notes: '比喻事情又熟悉又容易。',
  },
  {
    id: 250,
    words: '流口常谈',
    notes: '人人挂在嘴上的老话。',
  },
  {
    id: 251,
    words: '驾轻就熟',
    notes: '比喻对某事有经验，很熟悉，做起来容易。',
  },
  {
    id: 252,
    words: '毫不例外',
    notes: '一点都不例外，当然也就全然一致。',
  },
  {
    id: 253,
    words: '无一例外',
    notes: '都是这样，没有其他特殊的。',
  },
  {
    id: 254,
    words: '无一幸免',
    notes: '没有一个能侥幸得以避免。',
  },
  {
    id: 255,
    words: '不出所料',
    notes: '事由变化，在预料之中。',
  },
  {
    id: 256,
    words: '堂而皇之',
    notes: '堂皇：官署的大堂，引申为气势盛大的样子。',
  },
  {
    id: 257,
    words: '滥竽充数',
    notes: '无本领的冒充有本领，次货冒充好货。',
  },
  {
    id: 258,
    words: '妙语连珠',
    notes: '巧妙风趣的话一个接一个。',
  },
  {
    id: 259,
    words: '龙蛇混杂',
    notes: '好的和坏的混在一起。',
  },
  {
    id: 260,
    words: '应接不暇',
    notes: '原形容景物繁多，来不及观赏。现多形容来人或事情太多，应付不过来。',
  },
  {
    id: 261,
    words: '逸闻轶事',
    notes: '指世人不知道而感兴趣的传闻和故事。',
  },
  {
    id: 262,
    words: '因地制宜',
    notes: '根据各地的具体情况，制定适宜的办法。',
  },
  {
    id: 263,
    words: '胡编乱造',
    notes: '没有根据、不合情理地胡乱编造。',
  },
  {
    id: 264,
    words: '羚羊挂角',
    notes: '比喻意境超脱，不着形迹。',
  },
  {
    id: 265,
    words: '炙手可热',
    notes: '比喻权势大，气焰盛，使人不敢接近。',
  },
  {
    id: 266,
    words: '妙手偶得',
    notes: '指技术高超的人，偶然间得到的灵感或作品。也用来形容文学素养很深的人，出于灵感，即可偶然间得到妙语佳作。',
  },
  {
    id: 267,
    words: '异军突起',
    notes: '比喻一支新生力量突然出现。',
  },
  {
    id: 268,
    words: '深入浅出',
    notes: '指讲话或文章的内容深刻，语言文字却浅显易懂。',
  },
  {
    id: 269,
    words: '此起彼伏',
    notes: '形容接连不断。',
  },
  {
    id: 270,
    words: '少之又少',
    notes: '很少很少，几乎没有。',
  },
  {
    id: 271,
    words: '大道至简',
    notes: '指大道理是极其简单的。',
  },
  {
    id: 272,
    words: '前仆后继',
    notes: '形容不怕牺牲，英勇奋战。',
  },
  {
    id: 273,
    words: '纷至沓来',
    notes: '纷：众多，杂乱。沓：多，重复。形容接连不断的到来。',
  },
  {
    id: 274,
    words: '通俗易懂',
    notes: '广大人民群众都能懂得。',
  },
  {
    id: 275,
    words: '兼收并蓄',
    notes: '把不同内容、不同性质的东西收下来，保存起来。',
  },
  {
    id: 276,
    words: '画饼充饥',
    notes: '画个饼来解除饥饿。比喻用空想来安慰自己或欺骗别人。',
  },
  {
    id: 277,
    words: '不温不火',
    notes: '不冷淡也不火爆，形容平淡适中。',
  },
  {
    id: 278,
    words: '不绝如缕',
    notes: '多形容局面危急或声音、气息等低沉微弱、时断时续。',
  },
  {
    id: 279,
    words: '后继无人',
    notes: '没有后人来继承前人的事业。',
  },
  {
    id: 280,
    words: '粉墨登场',
    notes: '比喻坏人经过一番打扮，登上政治舞台。',
  },
  {
    id: 281,
    words: '拔地而起',
    notes: '突出地面，陡然矗立在地面上。',
  },
  {
    id: 282,
    words: '横空出世',
    notes: '指突然出现，或比喻卓尔不群。',
  },
  {
    id: 283,
    words: '破土而出',
    notes: '指种子发芽长出地面，新的事物刚刚出现。',
  },
  {
    id: 284,
    words: '海晏河清',
    notes: '黄河水清了，大海没有浪了，比喻天下太平。',
  },
  {
    id: 285,
    words: '渊渟岳峙',
    notes: '喻指人品德如渊水深沉，如高山耸立。',
  },
  {
    id: 286,
    words: '钟灵毓秀',
    notes: '指山川秀美，人才辈出。',
  },
  {
    id: 287,
    words: '瑕瑜互见',
    notes: '比喻优点、缺点都有，可表评价。',
  },
  {
    id: 288,
    words: '循规蹈矩',
    notes: '遵守规矩，不敢违反。',
  },
  {
    id: 289,
    words: '因噎废食',
    notes: '原指因为有人吃饭噎死了，就想让天下人都不吃饭。比喻要做的事情由于出了点小毛病或怕出问题就索性不去干。',
  },
  {
    id: 290,
    words: '按部就班',
    notes: '按照一定的步骤、顺序进行。',
  },
  {
    id: 291,
    words: '投闲置散',
    notes: '安排在不重要的职位或没有安排工作。',
  },
  {
    id: 292,
    words: '循序渐进',
    notes: '按照一定的步骤逐渐深入或提高。',
  },
  {
    id: 293,
    words: '贪大求快',
    notes: '过分地贪图规模大并且要求速度快。',
  },
  {
    id: 294,
    words: '按图索骥',
    notes: '比喻按照线索去寻求; 也比喻墨守成规办事。',
  },
  {
    id: 295,
    words: '急于求成',
    notes: '急着取得成功。',
  },
  {
    id: 296,
    words: '撼天震地',
    notes: '震动了天地，形容声音或声势极大。',
  },
  {
    id: 297,
    words: '举足轻重',
    notes: '指处于重要地位，一举一动都足以影响全局。',
  },
  {
    id: 298,
    words: '振聋发聩',
    notes: '用语言文字唤醒糊涂麻木的人，使他们清醒过来。',
  },
  {
    id: 299,
    words: '醍醐灌顶',
    notes: '比喻听了高明的意见使人受到很大启发。',
  },
  {
    id: 300,
    words: '与生俱来',
    notes: '一生下来就是如此。',
  },
  {
    id: 301,
    words: '难以割舍',
    notes: '形容对人或事物的感情很深，难以放弃或分开。',
  },
  {
    id: 302,
    words: '刻骨铭心',
    notes: '铭刻在心灵深处，形容记忆深刻，永远不忘。',
  },
  {
    id: 303,
    words: '永生难忘',
    notes: '指一辈子也难以忘怀。',
  },
  {
    id: 304,
    words: '言简意赅',
    notes: '言语简明而意思完备。',
  },
  {
    id: 305,
    words: '沉思翰藻',
    notes: '寓意深刻，文辞华丽。',
  },
  {
    id: 306,
    words: '不胜枚举',
    notes: '形容数量很多。',
  },
  {
    id: 307,
    words: '形神兼备',
    notes: '有形态且有神韵。',
  },
  {
    id: 308,
    words: '改天换地',
    notes: '彻底改变原来的面貌。比喻彻底的大规模的变革。常用来指自然或社会的根本变革，改造社会，改造自然。',
  },
  {
    id: 309,
    words: '文采斐然',
    notes: '文采好。',
  },
  {
    id: 310,
    words: '举不胜举',
    notes: '形容数量很多。',
  },
  {
    id: 311,
    words: '缀玉联珠',
    notes: '比喻写美好的诗文。',
  },
  {
    id: 312,
    words: '春秋笔法',
    notes: '用笔曲折而意含褒贬的写作手法。',
  },
  {
    id: 313,
    words: '弹冠相庆',
    notes: '指官场中一人当了官或升了官，同伙就互相庆贺将有官可做。',
  },
  {
    id: 314,
    words: '言外之意',
    notes: '话里暗含着的没有直接说出的意思。',
  },
  {
    id: 315,
    words: '低头折节',
    notes: '丧失气节，屈服于他人。',
  },
  {
    id: 316,
    words: '弦外之音',
    notes: '在话里间接透露，而不是明说出来的意思。',
  },
  {
    id: 317,
    words: '额手称庆',
    notes: '表示庆幸。',
  },
  {
    id: 318,
    words: '微言大义',
    notes: '精微的语言里包含着深刻的含义。',
  },
  {
    id: 319,
    words: '击节赞叹',
    notes: '形容对人的行为、言论、诗文、技艺等十分赞赏。',
  },
  {
    id: 320,
    words: '一知半解',
    notes: '形容知道得不全面，理解得不深不透。',
  },
  {
    id: 321,
    words: '茫然不解',
    notes: '一无所知，不理解。',
  },
  {
    id: 322,
    words: '不求甚解',
    notes: '常指学习或研究不认真、不深入。',
  },
  {
    id: 323,
    words: '知之甚少',
    notes: '对某方面知道的太少。',
  },
  {
    id: 324,
    words: '拨云见日',
    notes: '比喻冲破黑暗见到光明，也比喻疑团消除。',
  },
  {
    id: 325,
    words: '激浊扬清',
    notes: '比喻清除坏的，发扬好的。',
  },
  {
    id: 326,
    words: '沉渣泛起',
    notes: '比喻已经绝迹了的腐朽、陈旧事物又重新出现。',
  },
  {
    id: 327,
    words: '振臂高呼',
    notes: '举起手欢呼，形容非常高兴。',
  },
  {
    id: 328,
    words: '旁若无人',
    notes: '身旁好像没有人。',
  },
  {
    id: 329,
    words: '素不相识',
    notes: '向来不认识。',
  },
  {
    id: 330,
    words: '熟视无睹',
    notes: '虽然经常看到，却跟没有看见一样，形容不关心。',
  },
  {
    id: 331,
    words: '置若罔闻',
    notes: '放在一边不管，像没有听见一样，形容不重视、不关心。',
  },
  {
    id: 332,
    words: '铢积寸累',
    notes: '铢：我国古代极小的重量单位。形容一点一滴地积累。也形容事物完成的不容易。',
  },
  {
    id: 333,
    words: '一盘散沙',
    notes: '比喻力量分散，没有组织起来。',
  },
  {
    id: 334,
    words: '兴旺发达',
    notes: '指事物或事业充分发展、欣欣向荣的景象。',
  },
  {
    id: 335,
    words: '人心涣散',
    notes: '形容人心不齐。',
  },
  {
    id: 336,
    words: '繁荣昌盛',
    notes: '指国家兴旺发达，欣欣向荣。',
  },
  {
    id: 337,
    words: '离心离德',
    notes: '思想不统一，信念也不一致，指不一条心。',
  },
  {
    id: 338,
    words: '蒸蒸日上',
    notes: '形容事业一天天向上发展。',
  },
  {
    id: 339,
    words: '分崩离析',
    notes: '形容国家或集团分裂瓦解。',
  },
  {
    id: 340,
    words: '变幻莫测',
    notes: '指事物变化迅速，变化多端，不能预料。',
  },
  {
    id: 341,
    words: '斗转星移',
    notes: '星斗变动位置，指季节或时间的变化。',
  },
  {
    id: 342,
    words: '阳春白雪',
    notes: '原指古代楚国的一种艺术性较强难度较大的歌曲。后泛指高雅的、不通俗的文学艺术。',
  },
  {
    id: 343,
    words: '日异月殊',
    notes: '每天每月都有差异，形容变化大。',
  },
  {
    id: 344,
    words: '病入膏肓',
    notes: '形容病情十分严重，无法医治，比喻事情到了无法挽救的地步。',
  },
  {
    id: 345,
    words: '动荡不安',
    notes: '形容局势不稳定，不平静。',
  },
  {
    id: 346,
    words: '阴差阳错',
    notes: '比喻因偶然的因素而造成了差错。',
  },
  {
    id: 347,
    words: '死气沉沉',
    notes: '形容气氛不活泼;也形容人精神消沉，不振作。',
  },
  {
    id: 348,
    words: '经天纬地',
    notes: '形容有治理天下的经世之才，能做非常伟大的事业。',
  },
  {
    id: 349,
    words: '不期而遇',
    notes: '没有约定而遇见，指意外碰见。',
  },
  {
    id: 350,
    words: '了无生机',
    notes: '一点生命的活力都没有。',
  },
  {
    id: 351,
    words: '连绵不断',
    notes: '连续而不中断。',
  },
  {
    id: 352,
    words: '机缘巧合',
    notes: '特殊的缘分，巧妙的融合遇到，在一起。',
  },
  {
    id: 353,
    words: '奄奄一息',
    notes: '形容临近死亡。',
  },
  {
    id: 354,
    words: '接踵而至',
    notes: '接连不断地来。',
  },
  {
    id: 355,
    words: '逢机会',
    notes: '遭逢机会。',
  },
  {
    id: 356,
    words: '专心致志',
    notes: '形容一心一意，聚精会神。',
  },
  {
    id: 357,
    words: '穷经皓首',
    notes: '专心研究经书和古籍。',
  },
  {
    id: 358,
    words: '学而不厌',
    notes: '学习总感到不满足，形容好学。',
  },
  {
    id: 359,
    words: '锲而不舍',
    notes: '比喻有恒心，有毅力。',
  },
  {
    id: 360,
    words: '风流云散',
    notes: '像风流动，如云散开，比喻原来在一起的人四下离散。',
  },
  {
    id: 361,
    words: '风雨同舟',
    notes: '比喻共同经历患难。',
  },
  {
    id: 362,
    words: '如影随形',
    notes: '比喻两个人关系亲密，常在一起。',
  },
  {
    id: 363,
    words: '通同一气',
    notes: '串通在一起。',
  },
  {
    id: 364,
    words: '杏无音信',
    notes: '没有一点消息。',
  },
  {
    id: 365,
    words: '烟消云散',
    notes: '用来比喻事物消失得无影无踪。',
  },
  {
    id: 366,
    words: '无影无踪',
    notes: '形容完全消失，不知去向。',
  },
  {
    id: 367,
    words: '销声匿迹',
    notes: '形容消失得无影无踪;隐藏起来不出声不露面。',
  },
  {
    id: 368,
    words: '筚门圭窦',
    notes: '形容住室极其简陋，泛指贫苦人家。',
  },
  {
    id: 369,
    words: '岸芷汀兰',
    notes: '形容人像芳兰一样品德高尚，谦让有礼。',
  },
  {
    id: 370,
    words: '兰艾同焚',
    notes: '比喻好的坏的同归于尽，不分好坏，一同消灭。',
  },
  {
    id: 371,
    words: '粉墙黛瓦',
    notes: '指雪白的墙壁，青黑的瓦，用来描写房屋。',
  },
  {
    id: 372,
    words: '钟鸣鼎食',
    notes: '形容权贵的豪奢排场。',
  },
  {
    id: 373,
    words: '曲径通幽',
    notes: '弯曲而通到幽深僻静的地方。',
  },
  {
    id: 374,
    words: '桑枢瓮牖',
    notes: '用桑树做门轴，用瓦罐做窗户，比喻贫苦之家。',
  },
  {
    id: 375,
    words: '小桥流水',
    notes: '小桥下的水涓涓的流着，给人一种安定和谐的氛围。',
  },
  {
    id: 376,
    words: '如出一辙',
    notes: '比喻两件事情非常相似。',
  },
  {
    id: 377,
    words: '毫无二致',
    notes: '丝毫没有什么两样，指完全一样。',
  },
  {
    id: 378,
    words: '一脉相承',
    notes: '从同一血统、派别世代相承流传下来。',
  },
  {
    id: 379,
    words: '大同小异',
    notes: '大体相同，略有差异。',
  },
  {
    id: 380,
    words: '一脉相通',
    notes: '指事物之间相互关联，犹如一条脉络贯穿下来可以互通。',
  },
  {
    id: 381,
    words: '相差无几',
    notes: '彼此没有多大差别。',
  },
  {
    id: 382,
    words: '衣钵相传',
    notes: '比喻技术、学术的师徒相传。',
  },
  {
    id: 383,
    words: '半斤八两',
    notes: '比喻彼此一样，不相上下。',
  },
  {
    id: 384,
    words: '海水不可斗量',
    notes: '比喻不可根据某人的现状就低估他的未来。',
  },
  {
    id: 385,
    words: '登堂入室',
    notes: '比喻学问或技能从浅到深，达到很高的水平。',
  },
  {
    id: 386,
    words: '百思不得其解',
    notes: '百般思索也无法理解。',
  },
  {
    id: 387,
    words: '斗折蛇行',
    notes: '像北斗星一样弯曲，像蛇一样曲折行进，形容道路曲折蜒。',
  },
  {
    id: 388,
    words: '夏虫不可语冰',
    notes: '不能和生长在夏天的虫谈论冰，比喻时间局限人的见识也比喻人的见识短浅。',
  },
  {
    id: 389,
    words: '登高履危',
    notes: '比喻诚惶诚恐，非常小心谨慎以至达到害怕不安的程度。',
  },
  {
    id: 390,
    words: '可望而不可即',
    notes: '能望见，但达不到或不能接近。',
  },
  {
    id: 391,
    words: '拾级而上',
    notes: '一个台阶一个台阶地向上登。',
  },
  {
    id: 392,
    words: '叹为观止',
    notes: '指赞叹观赏的对象精妙至极、完美之至。',
  },
  {
    id: 393,
    words: '触目皆是',
    notes: '眼睛所看到的地方，到处都是。',
  },
  {
    id: 394,
    words: '争先恐后',
    notes: '争着向前，唯恐落后。',
  },
  {
    id: 395,
    words: '俯拾皆是',
    notes: '只要低下头来捡取，到处都是。',
  },
  {
    id: 396,
    words: '戎马倥偬',
    notes: '戎马：战马，借指战事。倥偬：急迫匆忙。在战争中奔走忙碌。形容军务繁忙。',
  },
  {
    id: 397,
    words: '无出其右',
    notes: '没有能超过他的。',
  },
  {
    id: 398,
    words: '车马盈门',
    notes: '盈：满。门前停满了车马。比喻宾客很多。',
  },
  {
    id: 399,
    words: '斗量车载',
    notes: '形容数量很多。',
  },
  {
    id: 400,
    words: '近在咫尺',
    notes: '形容距离很近。',
  },
  {
    id: 401,
    words: '唾手可得',
    notes: '动手就可以取得，比喻极容易得到。',
  },
  {
    id: 402,
    words: '触手可及',
    notes: '近在手边，一伸手就可以接触到。',
  },
  {
    id: 403,
    words: '一步之遥',
    notes: '一步的距离，比喻很近。',
  },
  {
    id: 404,
    words: '孜孜以求',
    notes: '不知疲倦地探求。',
  },
  {
    id: 405,
    words: '迷惑不解',
    notes: '指对某事非常疑惑，很不理解。',
  },
  {
    id: 406,
    words: '朝思暮想',
    notes: '形容非常想念或经常想着某一件事。',
  },
  {
    id: 407,
    words: '潜精研思',
    notes: '指专心钻研。',
  },
  {
    id: 408,
    words: '枝繁叶茂',
    notes: '形容枝叶繁盛茂密。',
  },
  {
    id: 409,
    words: '繁花似锦',
    notes: '许多色彩纷繁的鲜花，好像富多彩的锦缎，形容美好的景色和美好的事物。',
  },
  {
    id: 410,
    words: '春色满园',
    notes: '园内到处都是春天美丽的景色，比喻欣欣向荣的景象。',
  },
  {
    id: 411,
    words: '生机盎然',
    notes: '指充满生机和活力的，形容生命力旺盛的样子。',
  },
  {
    id: 412,
    words: '莫衷一是',
    notes: '形容意见分歧，没有一致的看法。',
  },
  {
    id: 413,
    words: '屡见不鲜',
    notes: '常常见到，并不新奇。',
  },
  {
    id: 414,
    words: '自以为是',
    notes: '总以为自己是对的，不接受他人意见，形容主观，不虚心。',
  },
  {
    id: 415,
    words: '数不胜数',
    notes: '形容数量极多，很难计算。',
  },
  {
    id: 416,
    words: '各行其是',
    notes: '按照各自认为对的去做，比喻各搞一套。',
  },
  {
    id: 417,
    words: '不一而足',
    notes: '指同类的事物不只一个而是很多，无法列举齐全。',
  },
  {
    id: 418,
    words: '积非成是',
    notes: '错误的东西积年累月维持下去，反而逐渐被当成正确的东西看待。',
  },
  {
    id: 419,
    words: '曲意逢迎',
    notes: '违背自己的本心去迎合别人的意思。指想方设法奉承讨好别人。',
  },
  {
    id: 420,
    words: '顾此失彼',
    notes: '形容照顾不过来，也形容忙乱或慌张的情景。',
  },
  {
    id: 421,
    words: '似是而非',
    notes: '指表面看来似乎对，而实际上并非如此。',
  },
  {
    id: 422,
    words: '莫名其妙',
    notes: '指事情很奇怪，说不出道理来，不能以言语表达出来。',
  },
  {
    id: 423,
    words: '改头换面',
    notes: '比喻只改外表和形式，内容实质不变。',
  },
  {
    id: 424,
    words: '惴惴不安',
    notes: '形容因害怕或担心而不安。',
  },
  {
    id: 425,
    words: '谈虎色变',
    notes: '比喻一提到可怕的事情，紧张的连脸色都变了。',
  },
  {
    id: 426,
    words: '杞人忧天',
    notes: '比喻不必要的或缺乏根据的忧虑和担心。',
  },
  {
    id: 427,
    words: '心灰意冷',
    notes: '灰心失望，意志消沉。',
  },
  {
    id: 428,
    words: '束手无策',
    notes: '形容就像捆住了手，没有一点办法。',
  },
  {
    id: 429,
    words: '心猿意马',
    notes: '比喻心思不专，变化不定。',
  },
  {
    id: 430,
    words: '郁郁寡欢',
    notes: '形容心里苦闷，闷闷不乐。',
  },
  {
    id: 431,
    words: '索然无味',
    notes: '形容事物枯燥无味。',
  },
  {
    id: 432,
    words: '大有可为',
    notes: '事情有发展前途，很值得做。',
  },
  {
    id: 433,
    words: '迫在眉睫',
    notes: '形容事情已到眼前，情势十分紧迫。',
  },
  {
    id: 434,
    words: '永无止境',
    notes: '永远没有尽头。',
  },
  {
    id: 435,
    words: '前途无量',
    notes: '指前途看好，无可限量。',
  },
  {
    id: 436,
    words: '砥砺前行',
    notes: '经历磨炼，克服困难，往前进步。',
  },
  {
    id: 437,
    words: '继往开来',
    notes: '继承前人的事业，开辟未来的道路。',
  },
  {
    id: 438,
    words: '一往无前',
    notes: '一直往前，无所阻挡，形容勇猛无畏地前进。',
  },
  {
    id: 439,
    words: '风雨兼程',
    notes: '在风雨中仍然不停的赶路，不避困难，预先约好的事情，一定按期进行。',
  },
  {
    id: 440,
    words: '见贤思齐',
    notes: '见到有才有德的人，就想向他学习，向他看齐。',
  },
  {
    id: 441,
    words: '洗心革面',
    notes: '清除旧思想，改变旧面貌，比喻彻底悔改。',
  },
  {
    id: 442,
    words: '兼听则明',
    notes: '要同时听取各方面的意见，才能正确认识事物。',
  },
  {
    id: 443,
    words: '闻过则喜',
    notes: '听到有人批评自己的过错就感到高兴，形容很虚心，指虚心接受意见。',
  },
  {
    id: 444,
    words: '一帆风顺',
    notes: '比喻非常顺利，没有任何阻碍。',
  },
  {
    id: 445,
    words: '无往不利',
    notes: '无论到什么地方或干什么事情，一切顺畅通利，指处处行得通，办得好。',
  },
  {
    id: 446,
    words: '天从人愿',
    notes: '指事物的发展正合自己的心愿。',
  },
  {
    id: 447,
    words: '左右逢源',
    notes: '比喻为人圆滑，两头讨好。',
  },
  {
    id: 448,
    words: '人言籍籍',
    notes: '指人们议论纷纷。',
  },
  {
    id: 449,
    words: '众口铄金',
    notes: '众人的言论能够熔化金属;比喻舆论影响的强大。',
  },
  {
    id: 450,
    words: '三人成虎',
    notes: '比喻说的人多了，就能使人们把谣言当事实。',
  },
  {
    id: 451,
    words: '流言蜚语',
    notes: '毫无根据的话，指背后散布的诽谤性的坏话。',
  },
  {
    id: 452,
    words: '擎天巨擘',
    notes: '形容坚强高大有力量;比喻杰出的人物。',
  },
  {
    id: 453,
    words: '中流砥柱',
    notes: '比喻能担当重任，在艰难环境中起支柱作用的集体或个人。',
  },
  {
    id: 454,
    words: '南天一柱',
    notes: '指栋梁之才。',
  },
  {
    id: 455,
    words: '栋梁之才',
    notes: '比喻能担当国家重任的人才。',
  },
  {
    id: 456,
    words: '脍炙人口',
    notes: '比喻好的诗文和事物受到人们的称赞和传颂。',
  },
  {
    id: 457,
    words: '斑驳陆离',
    notes: '斑驳:指一种颜色中混杂有其他颜色，不同色彩混杂在一起。陆离:色彩繁杂，参差不一。形容色彩繁杂，斑斓绚丽。',
  },
  {
    id: 458,
    words: '光怪陆离',
    notes: '光怪:光彩奇异；陆离:色彩繁杂、参差不一。形容形状奇怪，色彩繁杂，现象奇异，也形容事物离奇多变。',
  },
  {
    id: 459,
    words: '睹物思人',
    notes: '看见死去或离别的人留下的东西就想起了这个人。',
  },
  {
    id: 460,
    words: '鉴往知来',
    notes: '观察过去，便可推知未来。',
  },
  {
    id: 461,
    words: '抚今追昔',
    notes: '接触当前的事物而回想过去。',
  },
  {
    id: 462,
    words: '天翻地覆',
    notes: '覆：翻过来。形容变化巨大。也形容闹得很凶，或秩序大乱。',
  },
  {
    id: 463,
    words: '同日而语',
    notes: '把人或事物放在同一时间比较，放在一起谈论或看待。',
  },
  {
    id: 464,
    words: '精雕细琢',
    notes: '比喻做事情精益求精。',
  },
  {
    id: 465,
    words: '脚踏实地',
    notes: '比喻做事踏实，认真。',
  },
  {
    id: 466,
    words: '临渴掘井',
    notes: '等到口渴的时候才去挖井。比喻不早些准备，事到临头才想办法。',
  },
  {
    id: 467,
    words: '一丝不苟',
    notes: '做事认真细致，一点儿不马虎。',
  },
  {
    id: 468,
    words: '令人惊诧',
    notes: '让人感觉非常惊讶、诧异。',
  },
  {
    id: 469,
    words: '引人入胜',
    notes: '指风景或文艺作品特别吸引人。',
  },
  {
    id: 470,
    words: '咂舌攒眉',
    notes: '形容人吃酸物的表情或惊讶的神情。',
  },
  {
    id: 471,
    words: '蔚为壮观',
    notes: '形容盛大壮丽的景象。',
  },
  {
    id: 472,
    words: '众说纷纭',
    notes: '人多嘴杂，议论纷纷。',
  },
  {
    id: 473,
    words: '雪上加霜',
    notes: '比喻由于另外的原因使受损害的程度加重。',
  },
  {
    id: 474,
    words: '无所适从',
    notes: '不知听从哪一个好或不知怎么办才好。',
  },
  {
    id: 475,
    words: '落井下石',
    notes: '比喻乘人有危难时加以陷害。',
  },
  {
    id: 476,
    words: '首鼠两端',
    notes: '在两者之间犹豫不决，动摇不定。',
  },
  {
    id: 477,
    words: '推波助澜',
    notes: '喻从旁鼓动。',
  },
  {
    id: 478,
    words: '巧言令色',
    notes: '巧言：花言巧语。令色：讨好的表情。形容花言巧语，虚伪讨好。',
  },
  {
    id: 479,
    words: '煽风点火',
    notes: '鼓动别人做某种事。',
  },
  {
    id: 480,
    words: '包罗万象',
    notes: '形容内容丰富，应有尽有。',
  },
  {
    id: 481,
    words: '死而不僵',
    notes: '即使死了也不僵硬，形容坏势力等不容易被清除。',
  },
  {
    id: 482,
    words: '一成不变',
    notes: '一经形成，不再改变，形容连一点变化都没有。',
  },
  {
    id: 483,
    words: '老而常新',
    notes: '从古代就有，而且到现在也要重新去认识。',
  },
  {
    id: 484,
    words: '大家云集',
    notes: '著名的专家聚集在一起。',
  },
  {
    id: 485,
    words: '异彩纷呈',
    notes: '比喻突出的成就或表现纷纷呈现。',
  },
  {
    id: 486,
    words: '人才济济',
    notes: '形容人才众多。',
  },
  {
    id: 487,
    words: '百花齐放',
    notes: '比喻各种不同形式和风格的艺术自由发展，也形容艺术界的繁荣景象。',
  },
  {
    id: 488,
    words: '群英荟萃',
    notes: '比喻许多才能出众的人聚集在一起。',
  },
  {
    id: 489,
    words: '百家争鸣',
    notes: '指各种学术流派的自由争论，互相批评；也指不同意见的争论。',
  },
  {
    id: 490,
    words: '名家辈出',
    notes: '形容在某种学术或技能方面有特殊贡献的著名人物不断涌现。',
  },
  {
    id: 491,
    words: '流派纷呈',
    notes: '学术思想、文艺创作等方面的派别纷纷呈现。',
  },
  {
    id: 492,
    words: '有的放矢',
    notes: '比喻说话做事有明确的目的性和针对性。',
  },
  {
    id: 493,
    words: '行之有效',
    notes: '实行起来有成效。',
  },
  {
    id: 494,
    words: '独具匠心',
    notes: '具有独特的巧妙心思，多指技术或艺术方面有创造性。',
  },
  {
    id: 495,
    words: '得天独厚',
    notes: '具特殊的优越条件，也指所处的环境特别好，也指人的天赋、机遇非常好。',
  },
  {
    id: 496,
    words: '乏善可陈',
    notes: '说不出有什么优点，没有什么好称道的。',
  },
  {
    id: 497,
    words: '是非曲直',
    notes: '指正反对错，善恶好坏。',
  },
  {
    id: 498,
    words: '来龙去脉',
    notes: '比喻事物的来历或事情的前因后果。',
  },
  {
    id: 499,
    words: '轻重缓急',
    notes: '指事情的轻重、主次、缓急的区别。',
  },
  {
    id: 500,
    words: '千头万绪',
    notes: '比喻事情的开端，头绪非常多，也形容复杂纷乱。',
  },
  {
    id: 501,
    words: '萧疏清远',
    notes: '为组合词，两词连用可形容书画作品在风格或意境上的洒脱，气韵清远。',
  },
  {
    id: 502,
    words: '空灵荒寒',
    notes: '为组合词，可形容画作的风格、意境等。',
  },
  {
    id: 503,
    words: '耿介拔俗',
    notes: '为组合词，指正直之人，有志节而不与世苟合。',
  },
  {
    id: 504,
    words: '慷慨豪放',
    notes: '为组合词，形容书画诗词风格之时，多表现为情感充沛、激昂气象恢弘，雄豪奔放而毫无拘束的风格。',
  },
  {
    id: 505,
    words: '辑佚',
    notes: '辑录散佚的有关资料，对已经失传的文献资料加以搜集整理。',
  },
  {
    id: 506,
    words: '真伪杂糅',
    notes: '真假混杂在一起难以分辨。',
  },
  {
    id: 507,
    words: '鹤立鸡群',
    notes: '比喻仪表或才能在人群里很突出。',
  },
  {
    id: 508,
    words: '名副其实',
    notes: '名声或名义和实际相符。',
  },
  {
    id: 509,
    words: '独树一帜',
    notes: '比喻与众不同，自成一家。',
  },
  {
    id: 510,
    words: '名无虚传',
    notes: '流传的名声和实际相符合。',
  },
  {
    id: 511,
    words: '一枝独秀',
    notes: '形容最为突出，最为优秀。',
  },
  {
    id: 512,
    words: '当之无愧',
    notes: '当得起某种称号或荣誉，无须感到惭愧。',
  },
  {
    id: 513,
    words: '无与伦比',
    notes: '指事物非常完美，没有能够与它相比的同类的东西。',
  },
  {
    id: 514,
    words: '无可厚非',
    notes: '没有可过分责难的;指说话做事虽有缺点，但还有可取之处，应予谅解。',
  },
  {
    id: 515,
    words: '无人问津',
    notes: '比喻没有人来探问、尝试或购买，已遭冷落。',
  },
  {
    id: 516,
    words: '不见天日',
    notes: '原指乌云遮住天空和太阳，形容天气阴沉的厉害;现比喻社会黑暗、政治黑暗，见不到一点光明和希望。',
  },
  {
    id: 517,
    words: '称心如意',
    notes: '形容心满意足，事情的发展完全符合心意。',
  },
  {
    id: 518,
    words: '暗无天日',
    notes: '昏暗得看不到天上的日光;常用以形容在反动势力统治下社会的黑暗。',
  },
  {
    id: 519,
    words: '层见叠出',
    notes: '指接连不断地多次出现。',
  },
  {
    id: 520,
    words: '差强人意',
    notes: '勉强使人满意。',
  },
  {
    id: 521,
    words: '置之不理',
    notes: '放在一边，不理不睬。',
  },
  {
    id: 522,
    words: '不遂人愿',
    notes: '比喻事物的发展不合心愿。',
  },
  {
    id: 523,
    words: '泾渭分明',
    notes: '比喻界限清楚或是非分明。',
  },
  {
    id: 524,
    words: '削足适履',
    notes: '因为鞋小脚大，就把脚削去一块来凑合鞋的大小。比喻不合理地迁就现成条件，或不顾具体条件，生搬硬套。',
  },
  {
    id: 525,
    words: '大相径庭',
    notes: '表示彼此相差很远或矛盾很大，大不相同。',
  },
  {
    id: 526,
    words: '生搬硬套',
    notes: '指不顾实际情况，机械地运用别人的经验，照抄别人的办法。',
  },
  {
    id: 527,
    words: '久久为功',
    notes: '要持之以恒，锲而不舍，驰而不息。',
  },
  {
    id: 528,
    words: '奇幻诡谲',
    notes: '奇异虚幻，变化多端，令人捉摸不透。',
  },
  {
    id: 529,
    words: '入木三分',
    notes: '指书法刚劲有力。',
  },
  {
    id: 530,
    words: '标新立异',
    notes: '常指提出新的主张、见解或创造出新奇的样式。也指为了显示自故意显出自己的与众不同或者用往常不同的表达方式来吸引人。',
  },
  {
    id: 531,
    words: '矢志不渝',
    notes: '立志不会改变，表示永远不变心。',
  },
  {
    id: 532,
    words: '志在必得',
    notes: '立志要得到或完成某种愿望。',
  },
  {
    id: 533,
    words: '亘古不变',
    notes: '从古至今永远也不会改变。',
  },
  {
    id: 534,
    words: '孜孜不倦',
    notes: '指工作或学习勤奋不知疲倦。',
  },
  {
    id: 535,
    words: '洞若观火',
    notes: '形容观察事物非常清楚，好像看火一样。',
  },
  {
    id: 536,
    words: '颠扑不破',
    notes: '无论怎样摔打都破不了。比喻言论、学说等牢固可靠，经得起检验。',
  },
  {
    id: 537,
    words: '去粗取精',
    notes: '除去杂质，留取精华。',
  },
  {
    id: 538,
    words: '如法炮制',
    notes: '本指依照古法制药，后多指依照往例或现有的方法办事。',
  },
  {
    id: 539,
    words: '弃若敝履',
    notes: '像扔破鞋一样地扔掉，比喻毫不可惜地抛弃掉。',
  },
  {
    id: 540,
    words: '爱莫能助',
    notes: '形容虽然心中关切同情，非常愿意帮助，但因力量或条件的限制而没有办法做到。',
  },
  {
    id: 541,
    words: '漠然置之',
    notes: '指对人或事态度冷淡，放在一边不理。',
  },
  {
    id: 542,
    words: '原封不动',
    notes: '比喻保持原来的样子，一点不加变动。',
  },
  {
    id: 543,
    words: '束之高阁',
    notes: '捆起来以后放在高高的架子上，比喻放着不用，或放在一旁不管。',
  },
  {
    id: 544,
    words: '唇枪舌剑',
    notes: '争辩激烈，言辞锋利，像枪剑交锋一样。',
  },
  {
    id: 545,
    words: '字字珠玑',
    notes: '比喻说话、文章的遣词用字非常优美，也指说话或写文章言简意深，凝练有力，每个字都像珍珠一样珍贵。',
  },
  {
    id: 546,
    words: '雄辩高谈',
    notes: '辩论充分有力，言词豪放不羁，形容能言善辩。',
  },
  {
    id: 547,
    words: '丝丝入扣',
    notes: '比喻做得十分细致，有条不紊，紧凑合度，一一合拍，毫无出入。',
  },
  {
    id: 548,
    words: '舌战群儒',
    notes: '指同很多人辩论，并驳倒对方，多形口才好。',
  },
  {
    id: 549,
    words: '笔底生花',
    notes: '比喻文章写得生动、出色;也比喻文人才思泉涌，文笔富丽。',
  },
  {
    id: 550,
    words: '剑拔弩张',
    notes: '形容书法笔力道劲，后多形容气势逼人，或形势紧张，一触即发。',
  },
  {
    id: 551,
    words: '巧舌如簧',
    notes: '形容花言巧语，能说会道，善于狡辩。',
  },
  {
    id: 552,
    words: '以上率下',
    notes: '以自己为表率，作榜样给下属看。',
  },
  {
    id: 553,
    words: '指挥若定',
    notes: '形容态度冷静，考虑周全，指挥起来就像一切都事先规定好了似的。',
  },
  {
    id: 554,
    words: '处之泰然',
    notes: '指对待发生的紧急情况或困难，安然自得，毫不在乎。',
  },  
]